//============================================================================================================================================================================================

//void SayHello()
//{
//    Console.WriteLine("Приввет из метода void!");
//}

//============================================================================================================================================================================================

//Console.WriteLine("1. Старт программы в Main");

//FirstMethod();

//Console.WriteLine("6. Конец программы в Main");


//void FirstMethod()
//{
//    Console.WriteLine("2. Начало работы FirstMethod");

//    SecondMethod();

//    Console.WriteLine("5. Конец работы FirstMethod");
//}

//void SecondMethod()
//{
//    Console.WriteLine("3. Работает SecondMethod");
//    Console.WriteLine("4. Конец работы SecondMethod");
//}

//============================================================================================================================================================================================

//void Greet(string name, int age = 12)
//{
//    Console.WriteLine($"Привет, {name}! Тебе {age} лет.");
//}

//Greet("Виктор");
//Greet(age: 34, name: "Илья");

//============================================================================================================================================================================================

//FAQ(surname: "Узун", name: "Виктор");
//Console.WriteLine();
//FAQ(surname: "Пестерев", name: "Илья");

//void FAQ(string name, string surname)
//{
//    Console.WriteLine($"Имя: {name}\nФамилия: {surname}");
//}

//============================================================================================================================================================================================

//int Osent(int x, int y)
//{
//    return x * y;
//}

//int result = Osent(5, 4);
//Console.WriteLine(result);
//Console.ReadLine();

//============================================================================================================================================================================================
//DivideNumbers(10, 2);
//DivideNumbers(5, 0);


//void DivideNumbers(double a, double b)
//{
//    if (b == 0)
//    {
//        Console.WriteLine("Ошибка: Деление на ноль невозможно!");
//        return;
//    }

//    double result = a / b;
//    Console.WriteLine($"Результат деления: {result}");
//}

//============================================================================================================================================================================================